---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesUnlooped
source: html/d700b4dc-2bc1-beb4-fa23-ea9bf05518e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurvesUnlooped Property

Segments defining the Rebar Shape must be in a continuous loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurvesUnlooped { get; }
```